---
## 2.2.3-RC1

### 缺陷修复

- 修复部分已知问题
- 优化消息队列服务端缓存使用
- 添加消息队列广播事件支持
- 优化通讯服务器同步数据逻辑
- 优化RAFT协议

### 新功能

- 添加消息群组Endpoint API
- 新增群组成员扩展字段,包括:姓名,头像,扩展信息等等
- 添加服务端健康检查 API
- 完善通讯的整体架构

---
## 2.2.2-RC1

### 缺陷修复

- 修复一些小问题;

### 新功能

- 新增消息队列服务主题标识topicTag标记,用于业务逻辑的区分;
- 新增消息队列服务主题操作相关的事件广播,[订阅/取消订阅/主题删除/创建]等等事件;
- 新增主题消息持久化支持;
- 新增主题消息质量Qos保证参数支持;

---
## 2.2.1-RC1

### 缺陷修复

- 添加通讯服务器命名空间的支持(namespace);
- 添加通讯客户端SDK的命名空间的支持;
- 修复一些细小问题;
- 完善日志日系,方便系统问题排查;

### 新功能

- Master主服务端集群协议RAFT的支持;
- 模块化Master Connector;
- 模块化Server Replica;
- 分布式消息数据复制协议支持RAFT,GOSSIP;
- 添加消息队列服务(Message Queue);
- 添加消息消费链路支持;
- 添加消息队列的客户端(SDK);

---
## 2.2.0-RC2

### 缺陷修复

- 修复客户端群组操作异常问题
- 调整群组Endpoint请求参数问题
- 修复Master Endpoint Starter在Spring Boot 2.x自动装配问题
- 修复群组消息持久化部分属性值不准确问题
- 增强服务稳定性,提示容错能力
- 优化服务器日志
- 调整消息存储的Mongo数据结构
- 优化Master服务器与Cluster通讯节点数据同步效率

### 新功能

- 添加 Namespace 概念, 预留服务端和客户端操作入口, 默认为DEFAULT
- 新增群组消息已读/未读数量, 修复数量不准确问题
- 优化Master服务器与Cluster通讯节点数据同步效率
- 新增Master服务器 RAFT协议支持, 保证消息的一致性
- 增加Nas Client对七牛文件存储的支持
- 抽象统一Server Api Common模块

---
## 2.2.0-RC1

### 缺陷修复

- 修复Master服务与Cluster数据同步延迟问题;


### 新功能

- 添加查询群组成员Api
- 添加消息已读/未读状态推送;
- 添加群消息已读/未读数量;
- 添加群组在线/离线人员Api;
- 新增Master服务与Cluster服务Session同步问题;

---
## 2.1.0-RC6

### 新功能

- 添加媒体消息上传异步支持

---
## 2.1.0-RC5

### 缺陷修复

- 修复文件后缀不存在问题;

### 新功能

- 添加用户指定文件后缀的端口;
- DUBLE-CHECK Nas服务器配置;

---
## 2.1.0-RC4

### 新功能

- 添加媒体类消息透传数据支持

---
## 2.1.0-RC3

### 新功能

- 添加媒体消息支持
- 添加Acmedcare-Nas文件服务器支持
- 暴露NasClient对象给客户端

---
## 2.1.0-RC2

### 缺陷修复

- 修复通讯节点集群消息不能转发问题;
- 修复WebSocket包装消息不能解析问题;
- 修复Android开发库,故障自动迁移慢问题;
- 修复通讯节点与Master节点通讯故障自动迁移问题;
- 修复Android开发库编译版本问题,兼容Jdk 1.7;
- 修复Android Jar依赖重复文件检验不通过问题;

### 新功能

- 完善通讯节点通讯协议,包括(状态,同步,心跳,转发等);
- 完善通讯重试机制,新增重试超时线程池特性;

---
## 2.1.0-RC1

### 新功能

- WebSocket集成
- Master服务器(集群), Cluster通讯服务器发布(单机);
- Android客户端开发集成SDK发布;
- Android开发SDK文档参考User Guide